Repository: Dacasti02/24436116L
Catalog: omegat/project_save.tmx
Source language: en
Languages: es_es

source: This perspective is, of course, the template for almost every third-person video game that came after.
es_es: Esta perspectiva es, por supuesto, la plantilla para casi todos los videojuegos en tercera persona que vinieron después.

source: This sound object plays the sounds the Ganado would make, so while the Ganado itself has been culled, you still have the presence of it through those sounds.
es_es: Este objeto de sonido reproduce los sonidos que haría el Ganado, así que aunque el Ganado en sí ha sido eliminado, todavía tienes su presencia a través de esos sonidos.

source: To do that, we emphasized the attack of the sound to both make the sound easily identifiable by the user and make the sound have an impact that felt right.
es_es: Para ello, hicimos hincapié en el ataque del sonido para que el usuario pudiera identificarlo fácilmente y para que el sonido tuviera un impacto adecuado.

source: To elaborate a little further, for our Capcom sound team, producing realistic sound like that which is often found in modern games isn't a difficult task in itself, as far as our capability goes.
es_es: Para profundizar un poco más, para nuestro equipo de sonido de Capcom, producir un sonido realista como el que se encuentra a menudo en los juegos modernos no es una tarea difícil como tal dada nuestra capacidad.

source: To understand how the remake remixes and enhances the original game's soundscape, I picked the brains of RE4 sound director Hiroshi Tamura and lead composer Kota Suzuki to learn how they're making the game sound as good as it plays.
es_es: Para comprender cómo la nueva versión remezcla y mejora el campo sonoro del juego original, contacté con el director de sonido de RE4, Hiroshi Tamura, y con el compositor principal, Kota Suzuki, para saber cómo lo hacen para que el juego suene tan bien como se juega.

source: Using room portal in the game, that effect can be replicated in the game, and it will sound like the enemy's voice is coming from the direction of the door.
es_es: Usando el portal de la habitación en el juego, ese efecto se puede replicar en el juego, y sonará como si la voz del enemigo viniera de la dirección de la puerta.

source: We did a lot of interesting novel recordings like that.
es_es: Hicimos muchas grabaciones nuevas e interesantes como esa.

source: We gave a lot of thought on how to build a sense of fear.
es_es: Penamos mucho en cómo crear sensación de miedo.

source: We implemented it into the RE engine.
es_es: Lo implementamos en el motor de RE.

source: We recreated that balance while updating the game to the high level of modern standards.
es_es: Hemos recreado ese equilibrio al tiempo que actualizábamos el juego al alto nivel de los estándares modernos.

source: We use that throughout the world of this game.
es_es: Lo utilizamos en todo el juego del mundo.

source: We use these five layers to make up the overall sound of each space, which mimics the construction of environmental sound in the real world and creates a high level of realism.
es_es: Utilizamos estas cinco capas para componer el sonido global de cada espacio, lo que imita la construcción del sonido ambiental en el mundo real y crea un alto nivel de realismo.

source: We used a lot of different materials to make the sounds that appear in the game.
es_es: Hemos utilizado muchos materiales diferentes para crear los sonidos que aparecen en el juego.

source: We, of course, have to be aware of that fact and treat the sound of RE4 with the respect those fans want.
es_es: Nosotros, por supuesto, tenemos que ser conscientes de ello y tratar el sonido de RE4 con el respeto que los fans quieren.

source: What I like about the sounds, particularly for Battlefield, is the in-house HDR audio engine DICE uses; the dynamic range is so skillfully used.
es_es: Lo que más me gusta de los sonidos, sobre todo de Battlefield, es el motor de audio HDR interno que utiliza DICE.

source: What is the most unique method you used to achieve a sound effect?
es_es: ¿Cuál es el método más singular que ha utilizado para conseguir un efecto sonoro?

source: What it lacks, however, is context.
es_es: Lo que le falta, sin embargo, es contexto.

source: What this does is the sound of the wind is realistic and matches what you're seeing on screen, creating a sense of immersion.
es_es: Esto hace que el sonido del viento sea realista y coincida con lo que se ve en pantalla, lo que crea una sensación de inmersión.

source: What unique instruments or themes were used during composition?
es_es: ¿Qué instrumentos o temas únicos se utilizaron durante la composición?

source: What's an example of something that needed to sound hyper-realistic?
es_es: ¿Qué es un ejemplo de algo que necesitaba sonar hiperrealista?

source: What's your favorite?
es_es: ¿Cuál es tu favorito?

source: When he aimed, you looked directly over his right shoulder.
es_es: Cuando él apuntaba, veías directamente por encima de su hombro derecho

source: When this project started, first I played the original again and then analyzed what kind of approach the original had and why.
es_es: Cuando el proyecto empezó, primero puse la original otra vez y después analicé qué tipo de enfoque tenía y por qué.

source: While we kept that approach, if we used the same sounds as the original did, it wouldn't feel right in today's age.
es_es: Aunque hemos mantenido ese enfoque, si utilizásemos los mismos sonidos que en el original, no encajaría con la época actual.

source: Within that, you have character sounds, a good example to give is a gunshot.
es_es: Dentro de eso, tienes sonidos que hacen los personajes, un buen ejemplo de esto es un disparo.

source: You play as Leon Kennedy, now a special agent of the United States president sent to a remote Spanish village in search of the president's missing daughter, Ashley Graham.
es_es: Juegas como Leon Kennedy, el cual es ahora un agente especial del presidente de los Estados Unidos y que es enviado a un remoto pueblo español en busca de la hija desaparecida del presidente, Ashley Graham.

source: You're soon confronted by scores of angry locals infected by a parasite, Las Plagas, making them easy for the game's main antagonist to control without completely losing their mental faculties.
es_es: En seguida te ves enfrentado a hordas de habitantes furiosos infectados por un parásito, Las Plagas, que los hace fáciles de controlar por el antagonista principal del juego sin hacerles perder por completo sus facultades mentales.

source: by Blake Hester on Mar 17, 2023 at 02:01 AM
es_es: por Blake Hester el 17 de marzo de 2023 a las 02:01 AM
